# Write CSV

In [12]:
header=['Index','Customer_Id','First_Name','Last_Name','Company','City','Country','Phone1','Phone2','Email','Subscription_Date','Website']

In [13]:
string='1,DD37Cf93aecA6Dc,Sheryl,Baxter,Rasmussen Group,East Leonard,Chile,229.077.5154,397.884.0519x718,zunigavanessa@smith.info,2020-08-24,http://www.stephenson.com/'

In [14]:
string = ', '.join([f'"{x}"' for x in string.split(',')])
print(string)

"1", "DD37Cf93aecA6Dc", "Sheryl", "Baxter", "Rasmussen Group", "East Leonard", "Chile", "229.077.5154", "397.884.0519x718", "zunigavanessa@smith.info", "2020-08-24", "http://www.stephenson.com/"

In [20]:
data=["1", "DD37Cf93aecA6Dc", "Sheryl", "Baxter", "Rasmussen Group", "East Leonard", "Chile", "229.077.5154", "397.884.0519x718", "zunigavanessa@smith.info", "2020-08-24", "http://www.stephenson.com/"]

In [21]:
import csv

# Data to be written to the CSV file
data = [
    ['Name', 'Age', 'City'],
    ['Alice', 28, 'New York'],
    ['Bob', 22, 'San Francisco'],
    ['Charlie', 35, 'Los Angeles']
]

# Name of the CSV file
filename = 'people.csv'

# Writing to the CSV file
with open(filename, 'w', newline='') as csvfile:
    writer = csv.writer(csvfile)
    
    # Writing the data
    for row in data:
        writer.writerow(row)

print(f'Data written to {filename}')

Data written to people.csv

In [34]:
import pandas as pd

In [35]:
data=pd.read_csv('people.csv')

In [38]:
data.iloc[:,:2]

      Name  Age
0    Alice   28
1      Bob   22
2  Charlie   35